# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

array = [2, 3, 4, 5, 6]
array1 = []
total = 1

for i in range(len(array)//2 + len(array)%2):
    total = array[i] * array[len(array) - i - 1]
    array1.append(total)

print(array1)